## data type cast

In [1]:
import pandas as pd
import numpy as np
pd.Series([1, 2, np.nan, 1])

0    1.0
1    2.0
2    NaN
3    1.0
dtype: float64

In [2]:
pd.Series(['fd', None, 'k' ])

0      fd
1    None
2       k
dtype: object

In [7]:
pd.Series([True, np.nan, False])

0     True
1      NaN
2    False
dtype: object

## detecting null values

In [8]:
data = pd.Series([1, np.nan, 'hello', None])

In [9]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [11]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
data[data.notnull()] # used as a mask

0        1
2    hello
dtype: object

In [13]:
data.dropna()

0        1
2    hello
dtype: object

In [3]:
df = np.random.randint(0, 12, size = (3, 4))
df = pd.DataFrame(df, columns = list('ABCD'))
df

    A  B  C  D
0  10  9  0  6
1   6  9  0  5
2   7  8  9  7

In [4]:
df.iloc[[1,2], [2, 2]] = None
df

    A  B    C  D
0  10  9  0.0  6
1   6  9  NaN  5
2   7  8  NaN  7

In [35]:
df.dropna(axis =1) # default is 0 or rows

   A   B  D
0  1  10  2
1  9   3  3
2  1   1  8

In [5]:
df

    A  B    C  D
0  10  9  0.0  6
1   6  9  NaN  5
2   7  8  NaN  7

In [6]:
df.loc[[0, 1], ['C', 'D']] = None

In [7]:
df

    A  B   C    D
0  10  9 NaN  NaN
1   6  9 NaN  NaN
2   7  8 NaN  7.0

In [51]:
df.dropna(axis = 1, how = "all") # only drop the column if all value is NA

   A   B    D
0  1  10  NaN
1  9   3  NaN
2  1   1  8.0

## fill in default values

In [52]:
data = pd.Series([1, None, 2, np.nan, 3])

In [53]:
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [54]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

In [55]:
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [56]:
data.fillna(method = 'bfill') # fill the previous value

0    1.0
1    2.0
2    2.0
3    3.0
4    3.0
dtype: float64

In [8]:
df

    A  B   C    D
0  10  9 NaN  NaN
1   6  9 NaN  NaN
2   7  8 NaN  7.0

In [9]:
df.fillna(method = 'ffill', axis = 1)

      A    B    C    D
0  10.0  9.0  9.0  9.0
1   6.0  9.0  9.0  9.0
2   7.0  8.0  8.0  7.0

In [10]:
?df.fillna

Signature:
df.fillna(
    value=None,
    method=None,
    axis=None,
    inplace=False,
    limit=None,
    downcast=None,
    **kwargs,
)
Docstring:
Fill NA/NaN values using the specified method.

Parameters
----------
value : scalar, dict, Series, or DataFrame
    Value to use to fill holes (e.g. 0), alternately a
    dict/Series/DataFrame of values specifying which value to use for
    each index (for a Series) or column (for a DataFrame).  Values not
    in the dict/Series/DataFrame will not be filled. This value cannot
    be a list.
method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
    Method to use for filling holes in reindexed Series
    pad / ffill: propagate last valid observation forward to next valid
    backfill / bfill: use next valid observation to fill gap.
axis : {0 or 'index', 1 or 'columns'}
    Axis along which to fill missing values.
inplace : bool, default False
    If True, fill in-place. Note: this will modify any
    other views on this object (e.g., a no-copy slice for a column in a
    DataFrame).
limit : int, default None
    If method is specified, this is the maximum number of consecutive
    NaN values to forward/backward fill. In other words, if there is
    a gap with more than this number of consecutive NaNs, it will only
    be partially filled. If method is not specified, this is the
    maximum number of entries along the entire axis where NaNs will be
    filled. Must be greater than 0 if not None.
downcast : dict, default is None
    A dict of item->dtype of what to downcast if possible,
    or the string 'infer' which will try to downcast to an appropriate
    equal type (e.g. float64 to int64 if possible).

Returns
-------
DataFrame
    Object with missing values filled.

See Also
--------
interpolate : Fill NaN values using interpolation.
reindex : Conform object to new index.
asfreq : Convert TimeSeries to specified frequency.

Examples
--------
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                   columns=list('ABCD'))
>>> df
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

Replace all NaN elements with 0s.

>>> df.fillna(0)
    A   B   C   D
0   0.0 2.0 0.0 0
1   3.0 4.0 0.0 1
2   0.0 0.0 0.0 5
3   0.0 3.0 0.0 4

We can also propagate non-null values forward or backward.

>>> df.fillna(method='ffill')
    A   B   C   D
0   NaN 2.0 NaN 0
1   3.0 4.0 NaN 1
2   3.0 4.0 NaN 5
3   3.0 3.0 NaN 4

Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
2, and 3 respectively.

>>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
>>> df.fillna(value=values)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 2.0 1
2   0.0 1.0 2.0 5
3   0.0 3.0 2.0 4

Only replace the first NaN element.

>>> df.fillna(value=values, limit=1)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 NaN 1
2   NaN 1.0 NaN 5
3   NaN 3.0 NaN 4
File:      //anaconda3/lib/python3.7/site-packages/pandas/core/frame.py
Type:      method